Revit 2026 API

# ToposolidSplit Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> Split(
	IList<CurveLoop> splitCurveLoops
)
```
```vb
Public Function Split (
	splitCurveLoops As IList(Of CurveLoop)
) As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ Split(
	IList<CurveLoop^>^ splitCurveLoops
)
```
```fsharp
member Split :
        splitCurveLoops : IList<CurveLoop> -> IList<ElementId>
```

#### Parameters

splitCurveLoops IListCurveLoop

#### Return Value

IListElementId

#### Reference

Toposolid Class

Autodesk.Revit.DB Namespace